In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

In [4]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  13  15   6  18   7
1   5   9  15   9  13
2  19   9   8  19   5
3   4   4  15  14  12
4  17   8  17   4  12

In [6]:
df.query('A > 10')

    A   B   C   D   E
0  13  15   6  18   7
2  19   9   8  19   5
4  17   8  17   4  12

In [8]:
rerata = df['A'].mean()
rerata

11.6

In [10]:
df.query('A > @rerata')

    A   B   C   D   E
0  13  15   6  18   7
2  19   9   8  19   5
4  17   8  17   4  12